# Pandas exercise 1

#### 1.Load the "titanic" dataset and display the first 5 rows.

In [31]:
import pandas as pd
titanic = pd.read_csv('train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 2.How many passengers were in first class (Pclass=1) in the titanic dataset?

In [32]:
first_class=titanic[titanic['Pclass']==1]
num_first_class=len(first_class)
print(f"Number of passengers in first class: {num_first_class}")

Number of passengers in first class: 216


#### 3.Create a new column in the titanic dataset called "is_alone" which should be True if a passenger has no siblings/spouses or parents/children on board and False otherwise.

In [33]:
titanic['is_alone']=(titanic['SibSp']+titanic['Parch'])==0
print(titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  is_alone
0      0         A/5 21171   7.2500   NaN        S     False
1      0          PC 17599  71.2833   C85        C     False
2      0  STON/O2. 3101282   7.9250   NaN        S      True
3      0            113803  53.1000  C123        S     False
4      0            373450   8.0500   NaN        S      True

#### 4.Group the titanic dataset by "Pclass" and calculate the mean "Age" for each class.

In [34]:
import pandas as pd
mean_age=titanic.groupby('Pclass')['Age'].mean().round(2) 
print(mean_age)

# The mean age for passengers in first class (Pclass=1) is approximately 38.23 years.
# The mean age for passengers in second class (Pclass=2) is approximately 29.88 years.
# The mean age for passengers in third class (Pclass=3) is approximately 25.14 years.

Pclass
1    38.23
2    29.88
3    25.14
Name: Age, dtype: float64

#### 5.Sort the titanic dataset by "Fare" in descending order and display the first 10 rows.

In [35]:
sort_by_fare=titanic.sort_values(by='Fare',ascending=False)
print(sort_by_fare.head(10))

     PassengerId  Survived  Pclass                                   Name  \
258          259         1       1                       Ward, Miss. Anna
737          738         1       1                 Lesurer, Mr. Gustave J
679          680         1       1     Cardeza, Mr. Thomas Drake Martinez
88            89         1       1             Fortune, Miss. Mabel Helen
27            28         0       1         Fortune, Mr. Charles Alexander
341          342         1       1         Fortune, Miss. Alice Elizabeth
438          439         0       1                      Fortune, Mr. Mark
311          312         1       1             Ryerson, Miss. Emily Borie
742          743         1       1  Ryerson, Miss. Susan Parker "Suzette"
118          119         0       1               Baxter, Mr. Quigg Edmond

        Sex   Age  SibSp  Parch    Ticket      Fare            Cabin Embarked  \
258  female  35.0      0      0  PC 17755  512.3292              NaN        C
737    male  35.0      0      0  PC 17755  512.3292             B101        C
679    male  36.0      0      1  PC 17755  512.3292      B51 B53 B55        C
88   female  23.0      3      2     19950  263.0000      C23 C25 C27        S
27     male  19.0      3      2     19950  263.0000      C23 C25 C27        S
341  female  24.0      3      2     19950  263.0000      C23 C25 C27        S
438    male  64.0      1      4     19950  263.0000      C23 C25 C27        S
311  female  18.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
742  female  21.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
118    male  24.0      0      1  PC 17558  247.5208          B58 B60        C

     is_alone
258      True
737      True
679     False
88      False
27      False
341     False
438     False
311     False
742     False
118     False

#### 6.Create a new column in the titanic dataset called "fare_category" which should have the value "cheap" if the fare is less than 10, "moderate" if the fare is between 10 and 50, and "expensive" if the fare is greater than 50.

In [36]:
import pandas as pd
titanic['fare_category']=pd.cut(titanic['Fare'],bins=[0,10,50,float('inf')],labels=['cheap','moderate','expensive'])
print(titanic.head())      # pandas.cut() function is used to separate continuous data into discrete intervals (or bins). # 'inf'=infinity,# bins parameter determines the criteria for binning the data.

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  is_alone fare_category
0      0         A/5 21171   7.2500   NaN        S     False         cheap
1      0          PC 17599  71.2833   C85        C     False     expensive
2      0  STON/O2. 3101282   7.9250   NaN        S      True         cheap
3      0            113803  53.1000  C123        S     False     expensive
4      0            373450   8.0500   NaN        S      True         cheap

#### 7.Filter the titanic dataset to only include passengers who are male and survived.

In [37]:
import pandas as pd
male_survived=titanic[(titanic['Sex']=='male') & (titanic['Survived']==1)]
print(male_survived.head())

    PassengerId  Survived  Pclass                          Name   Sex   Age  \
17           18         1       2  Williams, Mr. Charles Eugene  male   NaN
21           22         1       2         Beesley, Mr. Lawrence  male  34.0
23           24         1       1  Sloper, Mr. William Thompson  male  28.0
36           37         1       3              Mamee, Mr. Hanna  male   NaN
55           56         1       1             Woolner, Mr. Hugh  male   NaN

    SibSp  Parch  Ticket     Fare Cabin Embarked  is_alone fare_category
17      0      0  244373  13.0000   NaN        S      True      moderate
21      0      0  248698  13.0000   D56        S      True      moderate
23      0      0  113788  35.5000    A6        S      True      moderate
36      0      0    2677   7.2292   NaN        C      True         cheap
55      0      0   19947  35.5000   C52        S      True      moderate

#### 8.Drop the "Cabin" column from the titanic dataset.

In [38]:
import pandas as pd
titanic.drop(columns=['Cabin'],inplace=True) #When you use inplace=True in a Pandas operation, it modifies the original DataFrame in place (i.e., directly), without creating a new copy.
print(titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Embarked  is_alone fare_category
0      0         A/5 21171   7.2500        S     False         cheap
1      0          PC 17599  71.2833        C     False     expensive
2      0  STON/O2. 3101282   7.9250        S      True         cheap
3      0            113803  53.1000        S     False     expensive
4      0            373450   8.0500        S      True         cheap